grevaillot/svd_tools/headers/STM32F21x/can1.h
/** CAN1_FFA1R_FFA27 Filter FIFO assignment for filter 27 **/
#define CAN1_FFA1R_FFA27		(1 << 27)
/** CAN1_FFA1R_FFA26 Filter FIFO assignment for filter 26 **/
#define CAN1_FFA1R_FFA26		(1 << 26)
/** CAN1_FFA1R_FFA25 Filter FIFO assignment for filter 25 **/
#define CAN1_FFA1R_FFA25		(1 << 25)
/** CAN1_FFA1R_FFA24 Filter FIFO assignment for filter 24 **/
#define CAN1_FFA1R_FFA24		(1 << 24)
/** CAN1_FFA1R_FFA23 Filter FIFO assignment for filter 23 **/
#define CAN1_FFA1R_FFA23		(1 << 23)
/** CAN1_FFA1R_FFA22 Filter FIFO assignment for filter 22 **/
#define CAN1_FFA1R_FFA22		(1 << 22)
/** CAN1_FFA1R_FFA21 Filter FIFO assignment for filter 21 **/
#define CAN1_FFA1R_FFA21		(1 << 21)
/** CAN1_FFA1R_FFA20 Filter FIFO assignment for filter 20 **/
#define CAN1_FFA1R_FFA20		(1 << 20)
/** CAN1_FFA1R_FFA19 Filter FIFO assignment for filter 19 **/
#define CAN1_FFA1R_FFA19		(1 << 19)
/** CAN1_FFA1R_FFA18 Filter FIFO assignment for filter 18 **/
#define CAN1_FFA1R_FFA18		(1 << 18)
/** CAN1_FFA1R_FFA17 Filter FIFO assignment for filter 17 **/
#define CAN1_FFA1R_FFA17		(1 << 17)
/** CAN1_FFA1R_FFA16 Filter FIFO assignment for filter 16 **/
#define CAN1_FFA1R_FFA16		(1 << 16)
/** CAN1_FFA1R_FFA15 Filter FIFO assignment for filter 15 **/
#define CAN1_FFA1R_FFA15		(1 << 15)
/** CAN1_FFA1R_FFA14 Filter FIFO assignment for filter 14 **/
#define CAN1_FFA1R_FFA14		(1 << 14)
/** CAN1_FFA1R_FFA13 Filter FIFO assignment for filter 13 **/
#define CAN1_FFA1R_FFA13		(1 << 13)
/** CAN1_FFA1R_FFA12 Filter FIFO assignment for filter 12 **/
#define CAN1_FFA1R_FFA12		(1 << 12)
/** CAN1_FFA1R_FFA11 Filter FIFO assignment for filter 11 **/
#define CAN1_FFA1R_FFA11		(1 << 11)
/** CAN1_FFA1R_FFA10 Filter FIFO assignment for filter 10 **/
#define CAN1_FFA1R_FFA10		(1 << 10)
/** CAN1_FFA1R_FFA9 Filter FIFO assignment for filter 9 **/
#define CAN1_FFA1R_FFA9		(1 << 9)
/** CAN1_FFA1R_FFA8 Filter FIFO assignment for filter 8 **/
#define CAN1_FFA1R_FFA8		(1 << 8)
/** CAN1_FFA1R_FFA7 Filter FIFO assignment for filter 7 **/
#define CAN1_FFA1R_FFA7		(1 << 7)
/** CAN1_FFA1R_FFA6 Filter FIFO assignment for filter 6 **/
#define CAN1_FFA1R_FFA6		(1 << 6)
/** CAN1_FFA1R_FFA5 Filter FIFO assignment for filter 5 **/
#define CAN1_FFA1R_FFA5		(1 << 5)
/** CAN1_FFA1R_FFA4 Filter FIFO assignment for filter 4 **/
#define CAN1_FFA1R_FFA4		(1 << 4)
/** CAN1_FFA1R_FFA3 Filter FIFO assignment for filter 3 **/
#define CAN1_FFA1R_FFA3		(1 << 3)
/** CAN1_FFA1R_FFA2 Filter FIFO assignment for filter 2 **/
#define CAN1_FFA1R_FFA2		(1 << 2)
/** CAN1_FFA1R_FFA1 Filter FIFO assignment for filter 1 **/
#define CAN1_FFA1R_FFA1		(1 << 1)
/** CAN1_FFA1R_FFA0 Filter FIFO assignment for filter 0 **/
#define CAN1_FFA1R_FFA0		(1 << 0)

/**@}*/

/** @defgroup can1_fa1r FA1R filter activation register
@{*/

/** CAN1_FA1R_FACT27 Filter active **/
#define CAN1_FA1R_FACT27		(1 << 27)
/** CAN1_FA1R_FACT26 Filter active **/
#define CAN1_FA1R_FACT26		(1 << 26)
/** CAN1_FA1R_FACT25 Filter active **/
#define CAN1_FA1R_FACT25		(1 << 25)
/** CAN1_FA1R_FACT24 Filter active **/
#define CAN1_FA1R_FACT24		(1 << 24)
/** CAN1_FA1R_FACT23 Filter active **/
#define CAN1_FA1R_FACT23		(1 << 23)
/** CAN1_FA1R_FACT22 Filter active **/
#define CAN1_FA1R_FACT22		(1 << 22)
/** CAN1_FA1R_FACT21 Filter active **/
#define CAN1_FA1R_FACT21		(1 << 21)
/** CAN1_FA1R_FACT20 Filter active **/
#define CAN1_FA1R_FACT20		(1 << 20)
/** CAN1_FA1R_FACT19 Filter active **/
#define CAN1_FA1R_FACT19		(1 << 19)
/** CAN1_FA1R_FACT18 Filter active **/
#define CAN1_FA1R_FACT18		(1 << 18)
/** CAN1_FA1R_FACT17 Filter active **/
#define CAN1_FA1R_FACT17		(1 << 17)
/** CAN1_FA1R_FACT16 Filter active **/
#define CAN1_FA1R_FACT16		(1 << 16)
/** CAN1_FA1R_FACT15 Filter active **/
#define CAN1_FA1R_FACT15		(1 << 15)
/** CAN1_FA1R_FACT14 Filter active **/
#define CAN1_FA1R_FACT14		(1 << 14)
/** CAN1_FA1R_FACT13 Filter active **/
#define CAN1_FA1R_FACT13		(1 << 13)
/** CAN1_FA1R_FACT12 Filter active **/
#define CAN1_FA1R_FACT12		(1 << 12)
/** CAN1_FA1R_FACT11 Filter active **/
#define CAN1_FA1R_FACT11		(1 << 11)
/** CAN1_FA1R_FACT10 Filter active **/
#define CAN1_FA1R_FACT10		(1 << 10)
/** CAN1_FA1R_FACT9 Filter active **/
#define CAN1_FA1R_FACT9		(1 << 9)
/** CAN1_FA1R_FACT8 Filter active **/
#define CAN1_FA1R_FACT8		(1 << 8)
/** CAN1_FA1R_FACT7 Filter active **/
#define CAN1_FA1R_FACT7		(1 << 7)
/** CAN1_FA1R_FACT6 Filter active **/
#define CAN1_FA1R_FACT6		(1 << 6)
/** CAN1_FA1R_FACT5 Filter active **/
#define CAN1_FA1R_FACT5		(1 << 5)
/** CAN1_FA1R_FACT4 Filter active **/
#define CAN1_FA1R_FACT4		(1 << 4)
/** CAN1_FA1R_FACT3 Filter active **/
#define CAN1_FA1R_FACT3		(1 << 3)
/** CAN1_FA1R_FACT2 Filter active **/
#define CAN1_FA1R_FACT2		(1 << 2)
/** CAN1_FA1R_FACT1 Filter active **/
#define CAN1_FA1R_FACT1		(1 << 1)
/** CAN1_FA1R_FACT0 Filter active **/
#define CAN1_FA1R_FACT0		(1 << 0)

/**@}*/

/** @defgroup can1_f0r1 F0R1 Filter bank 0 register 1
@{*/

/** CAN1_F0R1_FB31 Filter bits **/
#define CAN1_F0R1_FB31		(1 << 31)
/** CAN1_F0R1_FB30 Filter bits **/
#define CAN1_F0R1_FB30		(1 << 30)
/** CAN1_F0R1_FB29 Filter bits **/
#define CAN1_F0R1_FB29		(1 << 29)
/** CAN1_F0R1_FB28 Filter bits **/
#define CAN1_F0R1_FB28		(1 << 28)
/** CAN1_F0R1_FB27 Filter bits **/
#define CAN1_F0R1_FB27		(1 << 27)
/** CAN1_F0R1_FB26 Filter bits **/
#define CAN1_F0R1_FB26		(1 << 26)
/** CAN1_F0R1_FB25 Filter bits **/
#define CAN1_F0R1_FB25		(1 << 25)
/** CAN1_F0R1_FB24 Filter bits **/
#define CAN1_F0R1_FB24		(1 << 24)
/** CAN1_F0R1_FB23 Filter bits **/
#define CAN1_F0R1_FB23		(1 << 23)
/** CAN1_F0R1_FB22 Filter bits **/
#define CAN1_F0R1_FB22		(1 << 22)
/** CAN1_F0R1_FB21 Filter bits **/
#define CAN1_F0R1_FB21		(1 << 21)
/** CAN1_F0R1_FB20 Filter bits **/
#define CAN1_F0R1_FB20		(1 << 20)
/** CAN1_F0R1_FB19 Filter bits **/
#define CAN1_F0R1_FB19		(1 << 19)
/** CAN1_F0R1_FB18 Filter bits **/
#define CAN1_F0R1_FB18		(1 << 18)
/** CAN1_F0R1_FB17 Filter bits **/
#define CAN1_F0R1_FB17		(1 << 17)
/** CAN1_F0R1_FB16 Filter bits **/
#define CAN1_F0R1_FB16		(1 << 16)
/** CAN1_F0R1_FB15 Filter bits **/
#define CAN1_F0R1_FB15		(1 << 15)
/** CAN1_F0R1_FB14 Filter bits **/
#define CAN1_F0R1_FB14		(1 << 14)
/** CAN1_F0R1_FB13 Filter bits **/
#define CAN1_F0R1_FB13		(1 << 13)
/** CAN1_F0R1_FB12 Filter bits **/
#define CAN1_F0R1_FB12		(1 << 12)
/** CAN1_F0R1_FB11 Filter bits **/
#define CAN1_F0R1_FB11		(1 << 11)
/** CAN1_F0R1_FB10 Filter bits **/
#define CAN1_F0R1_FB10		(1 << 10)
/** CAN1_F0R1_FB9 Filter bits **/
#define CAN1_F0R1_FB9		(1 << 9)
/** CAN1_F0R1_FB8 Filter bits **/
#define CAN1_F0R1_FB8		(1 << 8)
/** CAN1_F0R1_FB7 Filter bits **/
#define CAN1_F0R1_FB7		(1 << 7)
/** CAN1_F0R1_FB6 Filter bits **/
#define CAN1_F0R1_FB6		(1 << 6)
/** CAN1_F0R1_FB5 Filter bits **/
#define CAN1_F0R1_FB5		(1 << 5)
/** CAN1_F0R1_FB4 Filter bits **/
#define CAN1_F0R1_FB4		(1 << 4)
/** CAN1_F0R1_FB3 Filter bits **/
#define CAN1_F0R1_FB3		(1 << 3)
/** CAN1_F0R1_FB2 Filter bits **/
#define CAN1_F0R1_FB2		(1 << 2)
/** CAN1_F0R1_FB1 Filter bits **/
#define CAN1_F0R1_FB1		(1 << 1)
/** CAN1_F0R1_FB0 Filter bits **/
#define CAN1_F0R1_FB0		(1 << 0)

/**@}*/

/** @defgroup can1_f0r2 F0R2 Filter bank 0 register 2
@{*/

